feat: split facility to reduce file sizes (#21)
